{
    "announcementList": [
        {
            "id": 1,
            "date": "5:14 PM: 14 November, 2023",
            "from": "Dr. Jillian Aurisano",
            "class": "User Interface",
            "title": "Group Project Progress",
            "message": "Hey everyone I hope you are making good progress on your Alterna-Canvas project! Just a quick reminder that the final turn-in will be this Wednesday. If you have any last minutes questions or concerns feel free to reach out to me or the TA."
        }, 
        {
            "id": 2,
            "date": "12:10 PM: 14 November, 2023",
            "from": "Dr. Armando Dorado",
            "class": "Senior Design",
            "title": "Project 3 Turn-In Extension",
            "message": "There has been a change of date to Project 3 turn-in. Due to the recent events with our system going down, and the internet having issues, I need to let everyone know that the Project 3 due date has been extended from 20 November to 24 November at 11:59PM. "
        }, 
        {
            "id": 3,
            "date": "1:18 PM: 13 November, 2023",
            "from": "Dr. Felix Manchester",
            "class": "Computer Graphics",
            "title": "Some Helpful Links",
            "message": "Recently we have been going over matrices and compiling 2-d images. I found some helpful links that came up during the class and wanted to share these with you all. The first one will involve using these to wrap 3-d objects, while the second can simplify vectors."
        }, 
        {
            "id": 4,
            "date": "10:11 AM: 13 November, 2023",
            "from": "Dr. Armando Dorado",
            "class": "Senior Design",
            "title": "Project 3 Updates",
            "message": "How is everyone feeling about Project 3? I have had multiple students voice concern to me over the recent power outages that have also effected the internet. I do not know if this is connected to the slower than average wi-fi speeds but it seems to be effecting some Students work."
        }, 
        {
            "id": 5,
            "date": "9:18 AM: 13 November, 2023",
            "from": "Dr. Jillian Aurisano",
            "class": "User Interface",
            "title": "A++ Work on your Project",
            "message": "This is the coolest project I have ever seen and I am so impressed by your group! Keep up the awesome work everyone!"
        },
        {
            "id": 6,
            "date": "4:32 PM: 12 November, 2023",
            "from": "Dr. Armando Dorado",
            "class": "Senior Design",
            "title": "Welcome to Week 12",
            "message": "Hello everyone and I hope you are having a good week. We will be going through the final two chapters this week leading up to the Final exam. A reminder that this will be at the usual meeting place on Dec 4, 2023 @ 2:00PM. Also I hope everyone is doing well on their final project this semester (Project 3)."
        } 
    ]
}

